import React from "react";

const cardsData = [
  {
    icon: "other_houses.svg",
    title: "მთავარი",
    description:
      "მიიღეთ სწრაფი წვდომა ყველა მნიშვნელოვან მონაცემზე, შეჯამებულ ანგარიშებზე და ბოლო აქტივობებზე. გაამარტივეთ სამუშაო პროცესი და მიიღეთ გადაწყვეტილებები რეალურ დროში.",
  },
  {
    icon: "person_edit.svg",
    title: "HR",
    description:
      "HR მოდული საშუალებას გაძლევს მართო შენი გუნდი ეფექტურად. დაამატო და მართო თანამშრომლების პროფილები,  განუსაზღვრო უფლებამოსილებები და როლები აკონტროლო სამუშაო საათები და დასწრება, მართო ხელფასები და ბონუსური სისტემები",
  },
  {
    icon: "list_alt_check.svg",
    title: "გეგმები",
    description:
      "გეგმების მოდული საშუალებას აძლევს კომპანიებს დაგეგმონ პროექტები, განსაზღვრონ ამოცანები და გაანაწილონ პასუხისმგებლობები. სისტემაში შესაძლებელია ამოცანების პროგრესის კონტროლი, შესრულების ვადების განსაზღვრა.",
  },
  {
    icon: "work.svg",
    title: "პორტფელი",
    description:
      "პორტფელის მოდული საშუალებას აძლევს კომპანიებს მართონ ყველა მიმდინარე და დასრულებული პროექტი ერთიან სივრცეში. პროექტების ორგანიზება, დოკუმენტაციის შენახვა და სამუშაო პროცესების მონიტორინგი ხდება მარტივი და სტრუქტურირებული.",
  },
  {
    icon: "arrow-left-right.svg",
    title: "მოლაპარაკებები",
    description:
      "მოლაპარაკებების მოდული გაძლევთ საშუალებას მართოთ ყველა კომუნიკაცია და შეთანხმება კლიენტებთან, პარტნიორებთან და გუნდთან. აკონტროლეთ დისკუსიების ისტორია, დააწესეთ შეხვედრები და დააფიქსირეთ მიღწეული შეთანხმებები.",
  },
  {
    icon: "person_edit.svg",
    title: "კლიენტები",
    description:
      "კლიენტების მართვის მოდული საშუალებას გაძლევთ მოაგროვოთ და მართოთ კლიენტთა მონაცემები ერთიან სივრცეში. დაამატოთ ახალი კლიენტები, დაარქივოთ ურთიერთობები და გაანალიზოთ კლიენტების ქცევები ეფექტური კომუნიკაციისთვის.",
  },
  {
    icon: "package_2.svg",
    title: "შეკვეთები",
    description:
      "შეკვეთების მართვის მოდული ამარტივებს შეკვეთების პროცესს. სისტემაში შეგიძლიათ შექმნათ, დაარედაქტიროთ და აკონტროლოთ შეკვეთები, განსაზღვროთ სტატუსები და მართოთ მათი შესრულების ეტაპები.",
  },
  {
    icon: "calendar_month.svg",
    title: "კალენდარი",
    description:
      "კალენდრის მოდული დაგეხმარებათ დააორგანიზოთ სამუშაო დრო და ღონისძიებები. დაგეგმეთ შეხვედრები, თვალყური ადევნეთ მნიშვნელოვან თარიღებს და გაიმარტივეთ დროის მართვა.",
  },
  {
    icon: "contract_edit.svg",
    title: "ლიდები",
    description:
      "ლიდების მართვის მოდული გაძლევთ შესაძლებლობას აკონტროლოთ პოტენციური კლიენტები და მათი განვითარების ეტაპები. განსაზღვრეთ ლიდების სტატუსები, დაახარისხეთ პრიორიტეტები და გაზარდეთ კონვერსიის მაჩვენებელი.",
  },
  {
    icon: "settings.svg",
    title: "პარამეტრები",
    description:
      "პარამეტრების მოდული გაძლევთ საშუალებას დააკონფიგურიროთ სისტემა თქვენი ბიზნესის საჭიროებების მიხედვით. მართეთ მომხმარებლის ნებართვები, განახორციელეთ ინტეგრაციები და დაარეგულირეთ პლატფორმის ძირითადი მახასიათებლები.",
  },
  {
    icon: "sms.svg",
    title: "კომუნიკაცია",
    description:
      "პარამეტრების მოდული გაძლევთ საშუალებას დააკონფიგურიროთ სისტემა თქვენი ბიზნესის საჭიროებების მიხედვით. მართეთ მომხმარებლის ნებართვები, განახორციელეთ ინტეგრაციები და დაარეგულირეთ პლატფორმის ძირითადი მახასიათებლები.",
  },
];

const RightBox = () => {
  return (
    <div
      className="w-full overflow-auto flex  justify-center pt-10 px-4 sm:px-6 md:px-8 lg:px-10 !pt-10 h-[80vh]!"
      style={{
        background: "linear-gradient(to bottom, #DBEAF6, #FEF2D6)",
        minHeight: "100%",
      }}
    >
      <div className="w-full max-w-4xl flex flex-col items-center h-[80vh]! ">
        <h2 className="!text-[24px]  w-[80%] !pb-10 sm:text-3xl md:text-4xl font-bold text-[#57686F] mb-6 text-center sm:text-left">
          SalesApp-ის მოდულები
        </h2>

        <div className="grid grid-cols-1 w-[80%] gap-4 sm:gap-5 md:gap-6  max-h-[800px] overflow-y-auto !pr-10">
          {cardsData.map((card, index) => (
            <div
              key={index}
              className="bg-[#FFFFFF] rounded-lg border-1 border-[#A0BFCB] !p-4 sm:p-5 md:p-6 flex !flex-col sm:flex-row items-start space-y-3 sm:space-y-0 sm:space-x-4"
            >
              <div className="flex-shrink-0 self-center sm:self-start">
                <img src={`./icons/${card.icon}`} />
              </div>
              <div className="text-center sm:text-left w-full !pt-4">
                <h3 className="text-base sm:text-lg md:text-xl font-medium text-[#57686F] mb-1">
                  {card.title}
                </h3>
                <p className="text-sm sm:text-base text-gray-600 !pt-4">
                  {card.description}
                </p>
              </div>
            </div>
          ))}
        </div>
      </div>
    </div>
  );
};

export default RightBox;
